{
    "maddening darkness": {
        "casting_range": "150 feet",
        "casting_time": "1 action",
        "classes": [
            "Warlock",
            "Wizard"
        ],
        "components": [
            "V",
            "M"
        ],
        "desc": "Magical darkness spreads from a point you choose within range to fill a 60—foot—radius sphere until the spell ends. The darkness spreads around corners. \n A creature with darkvision can’t see through this darkness. Nonmagical light, as well as light created by spells of 8th level or lower, can't illuminate the area. Shrieks, gibbering, and mad laughter can be heard within the sphere. Whenever a creature starts its turn in the sphere, it must make a Wisdom saving throw, taking 8d8 psychic damage on a failed save, or half as much damage on a successful one. \n",
        "duration": "Concentration, up to 10 minutes",
        "level": 8,
        "magic_school": "Evocation",
        "materials": "A drop of pitch mixed with a drop of mercury",
        "name": "Maddening Darkness",
        "ritual": false
    },
    "maelstrom": {
        "casting_range": "120 feet",
        "casting_time": "1 action",
        "classes": [
            "Druid"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "(paper or leaf in the shape of a funnel)A mass of 5-foot-deep water appears and swirls in a 30-foot radius centered on a point you can see within range. The point must be on ground or in a body of water. Until the spell ends, that area is difficult terrain, and any creature that starts its turn there must succeed on a Strength saving throw or take 6d6 bludgeoning damage and be pulled 10 feet toward the center. \n",
        "duration": "Concentration, up to 1 minute",
        "level": 5,
        "magic_school": "Evocation",
        "materials": "",
        "name": "Maelstrom",
        "ritual": false
    },
    "mage armor": {
        "casting_range": "Touch",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You touch a willing creature who isn’t wearing armor, and a protective magical force surrounds it until the spell ends. The target’s base AC becomes 13 + its Dexterity modifier. The spell ends it if the target dons armor or if you dismiss the spell as an action. \n",
        "duration": "8 hours",
        "level": 1,
        "magic_school": "Abjuration",
        "materials": "A piece of cured leather",
        "name": "Mage Armor",
        "ritual": false
    },
    "mage hand": {
        "casting_range": "30 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "A spectral, floating hand appears at a point you choose within range. \nThe hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again. \n\nYou can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it. \n\nThe hand can’t attack, activate magical items, or carry more than 10 pounds. \n",
        "duration": "1 minute",
        "level": 0,
        "magic_school": "Conjuration",
        "materials": "",
        "name": "Mage Hand",
        "ritual": false
    },
    "magic circle": {
        "casting_range": "10 feet",
        "casting_time": "1 minute",
        "classes": [
            "Cleric",
            "Paladin",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the floor or other surface. \n\nChoose one or more of the following types of creatures: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways:* The creature can’t willingly enter the cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a Charisma saving throw. \n* The creature has disadvantage on attack rolls against targets within the cylinder. \n* Targets within the cylinder can’t be charmed, frightened, or possessed by the creature. \n\nWhen you cast this spell, you can elect to cause its magic to operate in the reverse direction, preventing a creature of the specified type from leaving the cylinder and protecting targets outside it. \n\nAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd. \n",
        "duration": "1 hour",
        "level": 3,
        "magic_school": "Abjuration",
        "materials": "Holy water or powdered silver and iron worth at least 100 gp, which the spell consumes",
        "name": "Magic Circle",
        "ritual": false
    },
    "magic jar": {
        "casting_range": "Self",
        "casting_time": "1 minute",
        "classes": [
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "Your body falls into a catatonic state as your soul leaves it and enters the container you used for the spell’s material component. While your soul inhabits the container, you are aware of your surroundings as if you were in the container’s space. You can’t move or use reactions. The only action you can take is to project your soul up to 100 feet out of the container, either returning to your living body (and ending the spell) or attempting to possess a humanoids body. \n\nYou can attempt to possess any humanoid within 100 feet of you that you can see (creatures warded by a protection from evil and good or magic circle spells can’t be possessed). The target must make a Charisma saving throw. On a failure, your soul moves into the target’s body, and the target’s soul becomes trapped in the container. On a success, the target resists your efforts to possess it, and you can’t attempt to possess it again for 24 hours. \n\nOnce you possess a creature’s body, you control it. Your game statistics are replaced by the statistics of the creature though you retain your alignment and your Intelligence, Wisom, and Charisma scores. You retain the benefit of your own class feature. If the target has any class levels, you can’t use any of its class features. \n\nMeanwhile, the possessed creature’s soul can perceive from the container using its own senses, but it can’t move or take actions at all. \n\nWhile possessing a body, you can use your action to return from the host body to the container if it is within 100 feet of you, returning the host creature’s soul to its body. If the host body dies while you’re in it, the creature dies, and you must make a Charisma saving throw against your own spellcasting DC. On a success, you return to the container if it is within 100 feet of you. Otherwise, you die. \n\nIf the container is destroyed or the spell ends, your soul immediately returns to your body. If your body is more than 100 feet away from you, or if your body is dead when you attempt to return to it, you die. If another creature’s soul is in the container when it is destroyed, the creature’s soul returns to its body if the body is alive and within 100 feet. Otherwise, that creature dies. \n\nWhen the spell ends, the container is destroyed. \n",
        "duration": "Until dispelled",
        "level": 6,
        "magic_school": "Necromancy",
        "materials": "A gem, crystal, reliquary, or some other ornamental container worth at least 500 gp",
        "name": "Magic Jar",
        "ritual": false
    },
    "magic missile": {
        "casting_range": "120 feet",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously and you can direct them to hit one creature or several. \n\nAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st. \n",
        "duration": "Instantaneous",
        "level": 1,
        "magic_school": "Evocation",
        "materials": "",
        "name": "Magic Missile",
        "ritual": false
    },
    "magic mouth": {
        "casting_range": "30 feet",
        "casting_time": "1 minute",
        "classes": [
            "Bard",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You implant a message within an object in range, a message that is uttered when a trigger condition is met. \nChoose an object that you can see and that isn’t being worn or carried by another creature. Then speak the message, which must be 25 words or less, though it can be delivered over as long as 10 minutes. Finally, determine the circumstance that will trigger the spell to deliver your message. \n\nWhen that circumstance occurs, a magical mouth appears on the object and recites the message in your voice and at the same volume you spoke. If the object you chose has a mouth or something that looks like a mouth (for example, the mouth of a statue), the magical mouth appears there so that words appear to come from the object’s mouth. When you cast this spell, you can have the spell end after it delivers its message, or it can remain and repeats its message whenever the trigger occurs. \n\nThe triggering circumstance can be as general or as detailed as you like, though it must be based on visual or audible conditions that occur within 30 feet of the object. For example, you could instruct the mouth to speak when any creature moves within 30 feet of the object or when a silver bell rings within 30 feet of it. \n",
        "duration": "Until dispelled",
        "level": 2,
        "magic_school": "Illusion",
        "materials": "A small bit of honeycomb and jade dust worth at least 10 gp, which the spell consumes",
        "name": "Magic Mouth",
        "ritual": true
    },
    "magic stone": {
        "casting_range": "Touch",
        "casting_time": "1 bonus action",
        "classes": [
            "Druid",
            "Warlock"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, a pebble has a range of 60 feet. If someone else attacks with a pebble, that attacker adds your spellcasting ability modifier, not the attacker’s, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Whether the attack hits or misses, the spell then ends on the stone. \nIf you cast this spell again, the spell ends on any pebbles still affected by your previous casting. \n",
        "duration": "1 minute",
        "level": 0,
        "magic_school": "Transmutation",
        "materials": "",
        "name": "Magic Stone",
        "ritual": false
    },
    "magic weapon": {
        "casting_range": "Touch",
        "casting_time": "1 bonus action",
        "classes": [
            "Paladin",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls. \n\nAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the bonus increases to +2. \nWhen you use a spell slot of 6th level or higher, the bonus increases to +3. \n",
        "duration": "Concentration, up to 1 hour",
        "level": 2,
        "magic_school": "Transmutation",
        "materials": "",
        "name": "Magic Weapon",
        "ritual": false
    },
    "major image": {
        "casting_range": "120 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. \nThe image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench). \n\nAs long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. \n Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example. \n\nPhysical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature. \n\nAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled, without requiring your concentration. \n",
        "duration": "Concentration, up to 10 minutes",
        "level": 3,
        "magic_school": "Illusion",
        "materials": "A bit of fleece",
        "name": "Major Image",
        "ritual": false
    },
    "mass cure wounds": {
        "casting_range": "60 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Cleric",
            "Druid"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "A wave of healing energy washes out from a point of your choice within range. \n\nChoose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs. \n\nAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the healing increases by 1d8 for each slot level above 5th. \n",
        "duration": "Instantaneous",
        "level": 5,
        "magic_school": "Evocation",
        "materials": "",
        "name": "Mass Cure Wounds",
        "ritual": false
    },
    "mass heal": {
        "casting_range": "60 feet",
        "casting_time": "1 action",
        "classes": [
            "Cleric"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "A flood of healing energy flows from you into injured creatures around you. You restore up to 700 hit points, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell are also cured of all diseases and any effect making them blinded or deafened. This spell has no effect on undead or constructs. \n",
        "duration": "Instantaneous",
        "level": 9,
        "magic_school": "Evocation",
        "materials": "",
        "name": "Mass Heal",
        "ritual": false
    },
    "mass healing word": {
        "casting_range": "60 feet",
        "casting_time": "1 bonus action",
        "classes": [
            "Cleric"
        ],
        "components": [
            "V"
        ],
        "desc": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs. \n\nAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the healing increases by 1d4 for each slot level above 3rd. \n",
        "duration": "Instantaneous",
        "level": 3,
        "magic_school": "Evocation",
        "materials": "",
        "name": "Mass Healing Word",
        "ritual": false
    },
    "mass polymorph": {
        "casting_range": "120 feet",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Wizard",
            "Bard"
        ],
        "components": [
            "V.S",
            "M"
        ],
        "desc": "You transform up to ten creatures of your choice that you can see within range. An unwilling target must succeed on a Wisdom saving throw to resist the transformation. An unwilling shapechanger automatically succeeds on the save. \n\nEach target assumes a beast form of your choice, and you can choose the same form or different ones for each target. The new form can be any beast you have seen whose challenge rating is equal to or less than the target’s (or half the target’s level, if the target doesn’t have a challenge rating). The target’s game statistics, including mental ability scores, are replaced by the statistics of the chosen beast, but the target retains its hit points, alignment, and personality. \nEach target gains a number of temporary hit points equal to the hit points of its new form. These temporary hit points can’t be replaced by temporary hit points from another source. A target reverts to its normal form when it has no more temporary hit points or it dies. If the spell ends before then, the creature loses all its temporary hit points and reverts to its normal form. \nThe creature is limited in the actions it can perform by the nature of its new form. It can’t speak, cast spells, or do anything else that requires hands or speech. The target’s gear melds into the new form. \nThe target can’t activate, use, wield, or otherwise benefit from any of its equipment. \n",
        "duration": "Concentration, up to 1 hour",
        "level": 9,
        "magic_school": "Transmutation",
        "materials": "A caterpillar cocoon",
        "name": "Mass Polymorph",
        "ritual": false
    },
    "mass suggestion": {
        "casting_range": "60 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "V",
            "M"
        ],
        "desc": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. \nCreatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell. \n\nEach target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do. \n\nYou can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of soldiers give all their money to the first beggar they meet. If the condition isn’t met before the spell ends, the activity isn’t performed. \n\nIf you or any of your companions damage a creature affected by this spell, the spell ends for that creature. \n\nAt Higher Levels: When you cast this spell using a 7th-level spell slot, the duration is 10 days. \n\nWhen you use an 8th-level spell slot, the duration is 30 days. \nWhen you use a 9th-level spell slot, the duration is a year and a day. \n",
        "duration": "24 hours",
        "level": 6,
        "magic_school": "Enchantment",
        "materials": "A snake’s tongue and either a bit of honeycomb or a drop of sweet oil",
        "name": "Mass Suggestion",
        "ritual": false
    },
    "maximilians earthen grasp": {
        "casting_range": "30 feet",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You choose a 5-foot-square unoccupied space on the ground that you can see within range. A Medium hand made from compacted soil rises there and reachesfor one creature you can see within 5 feet of it. The target must make a Strength saving throw. On a failed save, the target takes 2d6 bludgeoning damage and is restrained for the spell’s duration. \nAs an action, you can cause the hand to crush the restrained target, who must make a Strength saving throw. It takes 2d6 bludgeoning damage on a failed save, or half as much damage on a successful one. \nTo break out, the restrained target can make a Strength check against your spell save DC. On a success, the target escapes and is no longer restrained by the hand. \nAs an action, you can cause the hand to reach for a different creature or to move to a different unoccupied space within range. The hand releases a restrained target if you do either. \n",
        "duration": "Concentration, up to 1 minute",
        "level": 2,
        "magic_school": "Transmutation",
        "materials": "A miniature hand sculpted from clay",
        "name": "Maximilians Earthen Grasp",
        "ritual": false
    },
    "maze": {
        "casting_range": "60 feet",
        "casting_time": "1 action",
        "classes": [
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "You banish a creature that you can see within range into a labyrinthine demiplane. The target remains there for the duration or until it escapes the maze. \n\nThe target can use its action to attempt to escape. When it does so, it makes a DC 20 Intelligence check. If it succeeds, it escapes, and the spell ends (a minotaur or goristro demon automatically succeeds). \n\nWhen the spell ends, the target reappears in the space it left or, if that space is occupied, in the nearest unoccupied space. \n",
        "duration": "Concentration, up to 10 minutes",
        "level": 8,
        "magic_school": "Conjuration",
        "materials": "",
        "name": "Maze",
        "ritual": false
    },
    "meld into stone": {
        "casting_range": "Touch",
        "casting_time": "1 action",
        "classes": [
            "Cleric",
            "Druid"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. \nUsing your movement, you step into the stone at a point you can touch. \n Nothing of your presence remains visible or otherwise detectable by nonmagical senses. \n\nWhile merged with the stone, you can’t see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. You otherwise can’t move. \n\nMinor physical damage to the stone doesn’t harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 bludgeoning damage to you. The stone’s complete destruction (or transmutation into a different substance) expels you and deals 50 bludgeoning damage to you. If expelled, you fall prone in an unoccupied space closest to where you first entered. \n",
        "duration": "8 hours",
        "level": 3,
        "magic_school": "Transmutation",
        "materials": "",
        "name": "Meld Into Stone",
        "ritual": true
    },
    "melfs acid arrow": {
        "casting_range": "90 feet",
        "casting_time": "1 action",
        "classes": [
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. \nMake a ranged spell attack against the target. On a hit, the target takes 4d4 acid damage immediately and 2d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn. \n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage (both initial and later) increases by 1d4 for each slot level above 2nd. \n",
        "duration": "Instantaneous",
        "level": 2,
        "magic_school": "Evocation",
        "materials": "Powdered rhubarb leaf and an adder’s stomach",
        "name": "Melfs Acid Arrow",
        "ritual": false
    },
    "melfs minute meteors": {
        "casting_range": "Self",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "(niter, sulfur, and pine tar formed into a bead)You create six tiny meteors in your space. They float in the air and orbit you for the spell’s duration. When you cast the spell—and as a bonus action on each of your turns thereafter—you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 120 feet of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 5 feet of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one. \nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the number of meteors created increases by two for each slot level above 3rd. \n",
        "duration": "Concentration, up to 10 minutes",
        "level": 3,
        "magic_school": "Evocation",
        "materials": "",
        "name": "Melfs Minute Meteors",
        "ritual": false
    },
    "mending": {
        "casting_range": "Touch",
        "casting_time": "1 minute",
        "classes": [
            "Bard",
            "Cleric",
            "Druid",
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "This spell repairs a single break or tear in an object you touch, such as broken chain link, two halves of a broken key, a torn cloack, or a leaking wineskin. \n\nAs long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage. \n\nThis spell can physically repair a magic item or construct, but the spell can’t restore magic to such an object. \n",
        "duration": "Instantaneous",
        "level": 0,
        "magic_school": "Transmutation",
        "materials": "Two lodestones",
        "name": "Mending",
        "ritual": false
    },
    "mental prison": {
        "casting_range": "60 feet",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "S"
        ],
        "desc": "You attempt to bind a creature within an illusory cell that only it perceives. One creature you can see within range must make an Intelligence saving throw. The target succeeds automatically if it is immune to being charmed. On a successful save, the target takes 5d10 psychic damage, and the spell ends. On a failed save, the target takes 5d10 psychic damage, and you make the area immediately around the target’s space appear dangerous to it in some way. You might cause the target to perceive itself as being surrounded by fire, floating razors, or hideous maws filled with dripping teeth. Whatever form the illusion takes, the target can’t see or hear anything beyond it and is restrained for the spell’s duration. If the target is moved out of the illusion, makes a melee attack through it, or reaches any part of its body through it, the target takes 10d10 psychic damage, and the spell ends. \n",
        "duration": "Concentration, up to 1 minute",
        "level": 6,
        "magic_school": "Illusion",
        "materials": "",
        "name": "Mental Prison",
        "ritual": false
    },
    "message": {
        "casting_range": "120 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You point your finger toward a creature within range and whisper a message. \nThe target (and only the target) hears the message and can reply in a whisper that only you can hear. \n\nYou can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn’t have to follow a straight line and can travel freely around corners or through openings. \n",
        "duration": "1 round",
        "level": 0,
        "magic_school": "Transmutation",
        "materials": "A short piece of copper wire",
        "name": "Message",
        "ritual": false
    },
    "meteor swarm": {
        "casting_range": "1 mile",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "Blazing orbs of fire plummet to the ground at four different points you can see within range. \nEach creature in a 40-foot-radius sphere centered on each point you choose must make a Dexterity saving throw. The sphere spreads around corners. A creature takes 20d6 fire damage and 20d6 bludgeoning damage on a failed save, or half as much damage on a sucessful one. A creature in the area of more than one fiery burst is affected only once. \n\nThe spell damages objects in the area and ignites flammable objects that aren’t being worn or carried. \n",
        "duration": "Instantaneous",
        "level": 9,
        "magic_school": "Evocation",
        "materials": "",
        "name": "Meteor Swarm",
        "ritual": false
    },
    "mighty fortress": {
        "casting_range": "1 mile",
        "casting_time": "1 minute",
        "classes": [
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "A fortress of stone erupts from a square area of ground of your choice that you can see within range. The area is 120 feet on each side, and it must not have any buildings or other structures on it. Any creatures in the area are harmlessly lifted up as the fortress rises. \nThe fortress has four turrets with square bases, each one 20 feet on a side and 30 feet tall, with one turret on each corner. The turrets are connected to each other by stone walls that are each 80 feet long, creating an enclosed area. Each wall is 1 foot thick and is composed of panels that are 10 feet wide and 20 feet tall. Each panel is contiguous with two other panels or one other panel and a turret. You can place up to four stone doors in the fortress’s outer wall. \nA small keep stands inside the enclosed area. The keep has a square base that is 50 feet on each side, and it has three floors with 10-foot-high ceilings. Each of the floors can be divided into as many rooms as you like, provided each room is at least 5 feet on each side. The floors of the keep are connected by stone staircases, its walls are 6 inches thick, and interior rooms can have stone doors or open archways as you choose. The keep is furnished and decorated however you like, and it contains sufficient food to serve a nine-course banquet for up to 100 people each day. Furnishings, food, and other objects created by this spell crumble to dust if removed from the fortress. \nA staff of one hundred invisible servants obeys anycommand given to them by creatures you designate when you cast the spell. Each servant functions as if created by the unseen servant spell. \nThe walls, turrets, and keep are all made of stone that can be damaged. Each 10—foot—bya10-foot section of stone has AC 15 and 30 hit points per inch of thickness. It is immune to poison and psychic damage. Reducing a section of stone to 0 hit points destroys it and might cause connected sections to buckle and collapse at the DM’s discretion. \nAfter 7 days or when you cast this spell somewhere else, the fortress harmlessly crumbles and sinks back into the ground, leaving any creatures that were inside it safely on the ground. \nCasting this spell on the same spot once every 7 days for a year makes the fortress permanent. \n",
        "duration": "Instantaneous",
        "level": 8,
        "magic_school": "Conjuration",
        "materials": "A diamond worth at least 500 gp, which the spell consumes",
        "name": "Mighty Fortress",
        "ritual": false
    },
    "mind blank": {
        "casting_range": "Touch",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "Until the spell ends, one willing creature you touch is immune to psychic damage, any effect that would sense its emotions or read its thoughts, divination spells, and the charmed condition. The spell even foils wish spells and spells or effects of similar power used to affect the target’s mind or to gain information about the target. \n",
        "duration": "24 hours",
        "level": 8,
        "magic_school": "Abjuration",
        "materials": "",
        "name": "Mind Blank",
        "ritual": false
    },
    "mind spike": {
        "casting_range": "60 feet",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "S"
        ],
        "desc": "You reach into the mind of one creature you can see within range. The target must make a Wisdom saving throw, taking 3d8 psychic damage on a failed save, or half as much damage on a successful one. On a failed save, you also always know the target's location until the spell ends, but only while the two of you are on the same plane of existence. While you have this knowledge, the target can’t become hidden from you, and if it’s invisible, it gains no benefit from that condition against you. \n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd. \n",
        "duration": "Concentration, up to 1 hour",
        "level": 2,
        "magic_school": "Divination",
        "materials": "",
        "name": "Mind Spike",
        "ritual": false
    },
    "minor illusion": {
        "casting_range": "30 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "S",
            "M"
        ],
        "desc": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again. \n\nIf you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends. \n\nIf you create an image of an object such as a chair, muddy footprints, or a small chest it must be no larger than a 5-foot cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it. \n\nIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature. \n",
        "duration": "1 minute",
        "level": 0,
        "magic_school": "Illusion",
        "materials": "A bit of fleece",
        "name": "Minor Illusion",
        "ritual": false
    },
    "mirage arcane": {
        "casting_range": "Sight",
        "casting_time": "10 minutes",
        "classes": [
            "Bard",
            "Druid",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. \nThe terrain’s general shape remains the same, however. Open fields or a road could be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. \n\nSimilarly, you can alter the appearance of structures, or add them where none are present. The spell doesn’t disguise, conceal, or add creatures. \n\nThe illusion includes audible, visual, tactile, and olfactory elements, so it can turn clear ground into difficult terrain (or vice versa) or otherwise impede movement through the area. Any piece of the illusory terrain (such as a rock or stick) that is removed from the spell’s area disappears immediately. \n\nCreatures with truesight can see through the illusion to the terrain’s true form however, all other elements of the illusion remain, so while the creature is aware of the illusion’s presence, the creature can still physically interact with the illusion. \n",
        "duration": "10 days",
        "level": 7,
        "magic_school": "Illusion",
        "materials": "",
        "name": "Mirage Arcane",
        "ritual": false
    },
    "mirror image": {
        "casting_range": "Self",
        "casting_time": "1 action",
        "classes": [
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "Three illusory duplicates of yourself appear in your space. \nUntil the spell ends, the duplicates move with you and mimic your actions, shifting position so it’s impossible to track which image is real. You can use your action to dismiss the illusory duplicates. \n\nEach time a creature targets you with an attack during the spell’s duration, roll a d20 to determine whether the attack instead targets one of your duplicates. \n\nIf you have three duplicates, you must roll a 6 or higher to change the attack’s target to a duplicate. With two duplicates, you must roll an 8 or higher. With one duplicate, you must roll an 11 or higher. \n\nA duplicate’s AC equals 10 + your Dexterity modifier. If an attack hits a duplicate, the duplicate is destroyed. A duplicate can be destroyed only by an attack that hits it. It ignores all other damage and effects. The spell ends when all three duplicates are destroyed. \n\nA creature is unaffected by this spell if it can’t see, if it relies on senses other than sight, such as blindsight, or if it can perceive illusions as false, as with truesight. \n",
        "duration": "1 minute",
        "level": 2,
        "magic_school": "Illusion",
        "materials": "",
        "name": "Mirror Image",
        "ritual": false
    },
    "mislead": {
        "casting_range": "Self",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Wizard"
        ],
        "components": [
            "S"
        ],
        "desc": "You become invisible at the same time that an illusory double of you appears where you are standing. The double lasts for the duration, but the invisibility ends if you attack or cast a spell. \n\nYou can use your action to move your illusory double up to twice your speed and make it gesture, speak, and behave in whatever way you choose. \n\nYou can see through its eyes and hear through its ears as if you were located where it is. On each of your turns as a bonus action, you can switch from using its senses to using your own, or back again. While you are using its senses, you are blinded and deafened in regard to your own surroundings. \n",
        "duration": "Concentration, up to 1 hour",
        "level": 5,
        "magic_school": "Illusion",
        "materials": "",
        "name": "Mislead",
        "ritual": false
    },
    "misty step": {
        "casting_range": "Self",
        "casting_time": "1 bonus action",
        "classes": [
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "components": [
            "V"
        ],
        "desc": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see. \n",
        "duration": "Instantaneous",
        "level": 2,
        "magic_school": "Conjuration",
        "materials": "",
        "name": "Misty Step",
        "ritual": false
    },
    "modify memory": {
        "casting_range": "30 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Wizard"
        ],
        "components": [
            "V",
            "S"
        ],
        "desc": "You attempt to reshape another creature’s memories. \nOne creature that you can see must make a Wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target’s memories are modified. \n\nWhile this charm lasts, you can affect the target’s memory of an event that it experienced within the last 24 hours and that lasted no more than 10 minutes. You can permanently eliminate all memory of the event, allow the target to recall the event with perfect clarity and exacting detail, change its memory of the details of the event, or create a memory of some other event. \n\nYou must speak to the target to describe how its memories are affected, and it must be able to understand your language for the modified memories to take root. Its mind fills in any gaps in the details of your description. If the spell ends before you have finished describing the modified memories, the creature’s memory isn’t altered. Otherwise, the modified memories take hold when the spell ends. \n\nA modified memory doesn’t necessarily affect how a creature behaves, particularly if the memory contradicts the creature’s natural inclinations, alignment, or beliefs. An illogical modified memory, such as implanting a memory of how much the creature enjoyed dousing itself in acid, is dismissed, perhaps as a bad dream. The DM might deem a modified memory too nonsensical to affect a creature in a significant manner. \n\nA remove curse or greater restoration spell cast on the target restores the creature’s true memory. \n\nAt Higher Levels: If you cast this spell using a spell slot of 6th level or higher, you can alter the target’s memories of an event that took place up to 7 days ago (6th level), 30 days ago (7th level), 1 year ago (8th level), or any time in the creature’s past (9th level). \n",
        "duration": "Concentration, up to 1 minute",
        "level": 5,
        "magic_school": "Enchantment",
        "materials": "",
        "name": "Modify Memory",
        "ritual": false
    },
    "mold earth": {
        "casting_range": "30 feet",
        "casting_time": "1 action",
        "classes": [
            "Druid",
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "S"
        ],
        "desc": "You choose a portion of dirt or stone that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways:• If you target an area of loose earth, you can instantaneously excavate it, move it along the ground, and deposit it up to 5 feet away. This movement doesn’t have enough force to cause damage. \n• You cause shapes, colors, or both to appear on the dirt or stone, spelling out words, creating images, or shaping patterns. The changes last for 1 hour. \n• If the dirt or stone you target is on the ground, you cause it to become difficult terrain. Alternatively, you can cause the ground to become normal terrain if it is already difficult terrain. This change lasts for 1 hour. If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action. \n",
        "duration": "Instantaneous or 1 hour",
        "level": 0,
        "magic_school": "Transmutation",
        "materials": "",
        "name": "Mold Earth",
        "ritual": false
    },
    "moonbeam": {
        "casting_range": "120 feet",
        "casting_time": "1 action",
        "classes": [
            "Druid"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "A silvery beam of pale light shines down in a 5-footradius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder. \n\nWhen a creature enters the spell’s area for the first time on a turn or starts its turn there, it is engulfed in ghostly flames that cause searing pain, and it must make a Constitution saving throw. It takes 2d10 radiant damage on a failed save, or half as much damage on a successful one. \n\nA shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its original form and can’t assume a different form until it leaves the spell’s light. \n\nOn each of your turns after you cast this spell, you can use an action to move the beam 60 feet in any direction. \n\nAt Higher Levels: When you cast this spell using aspell slot of 3rd level or higher, the damage increases by 1d1O for each slot level above 2nd. \n",
        "duration": "Concentration, up to 1 minute",
        "level": 2,
        "magic_school": "Evocation",
        "materials": "Several seeds of any moonseed plant and a piece of opalescent feldspar",
        "name": "Moonbeam",
        "ritual": false
    },
    "mordenkainens faithful hound": {
        "casting_range": "30 feet",
        "casting_time": "1 action",
        "classes": [
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You conjure a phantom watchdog in an unoccupied space that you can see within range, where it remains for the duration, until you dismiss it as an action, or until you move more than 100 feet away from it. \n\nThe hound is invisible to all creatures except you and can’t be harmed. When a Small or larger creature comes within 30 feet of it without first speaking the password that you specify when you cast this spell, the hound starts barking loudly. The hound sees invisible creatures and can see into the Ethereal Plane. It ignores illusions. \n\nAt the start of each of your turns, the hound attempts to bite one creature within 5 feet of it that is hostile to you. The hound’s attack bonus is equal to your spellcasting ability modifier + your proficiency bonus. On a hit, it deals 4d8 piercing damage. \n",
        "duration": "8 hours",
        "level": 4,
        "magic_school": "Conjuration",
        "materials": "A tiny silver whistle, a piece of bone, and a thread",
        "name": "Mordenkainens Faithful Hound",
        "ritual": false
    },
    "mordenkainens magnificent mansion": {
        "casting_range": "300 feet",
        "casting_time": "1 minute",
        "classes": [
            "Bard",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You conjure an extradimensional dwelling in range that lasts for the duration. \n\nYou choose where its one entrance is located. The entrance shimmers faintly and is 5 feet w ide and 10 feet tall. You and any creature you designate when you cast the spell can enter the extradimensional dwelling as long as the portal remains open. You can open or close the portal if you are within 30 feet of it. While closed, the portal is invisible. \n\nBeyond the portal is a magnificent foyer with numerous chambers beyond. The atmosphere is clean, fresh, and warm. \n\nYou can create any floor plan you like, but the space can’t exceed 50 cubes, each cube being 10 feet on each side. The place is furnished and decorated as you choose. It contains sufficient food to serve a ninecourse banquet for up to 100 people. A staff of 100 near-transparent servants attends all who enter. You decide the visual appearance of these servants and their attire. They are completely obedient to your orders. Each servant can perform any task a normal human servant could perform, but they can’t attack or take any action that would directly harm another creature. Thus the servants can fetch things, clean, mend, fold clothes, light fires, serve food, pour wine, and so on. The servants can go anywhere in the mansion but can’t leave it. Furnishings and other objects created by this spell dissipate into smoke if removed from the mansion. When the spell ends, any creatures inside the extradimensional space are expelled into the open spaces nearest to the entrance. \n",
        "duration": "24 hours",
        "level": 7,
        "magic_school": "Conjuration",
        "materials": "A miniature portal carved from ivory, a small piece of polished marble, and a tiny silver spoon, each item worth at least 5 gp",
        "name": "Mordenkainens Magnificent Mansion",
        "ritual": false
    },
    "mordenkainens private sanctum": {
        "casting_range": "120 feet",
        "casting_time": "10 minutes",
        "classes": [
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You make an area within range magically secure. \nThe area is a cube that can be as small as 5 feet to as large as 100 feet on each side. The spell lasts for the duration or until you use an action to dismiss it. \n\nWhen you cast the spell, you decide what sort of security the spell provides, choosing any or all of the following properties:* Sound can’t pass through the barrier at the edge of the warded area. \n* The barrier of the warded area appears dark and foggy, preventing vision (including darkvision) through it. \n* Sensors created by divination spells can’t appear inside the protected area or pass through the barrier at its perimeter. \n* Creatures in the area can’t be targeted by divination spells. \n* Nothing can teleport into or out of the warded area. \n* Planar travel is blocked within the warded area. \n\nCasting this spell on the same spot every day for a year makes this effect permanent. \n\nAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, you can increase the size of the cube by 100 feet for each slot level beyond 4th. Thus you could protect a cube that can be up to 200 feet on one side by using a spell slot o f 5th level. \n",
        "duration": "24 hours",
        "level": 4,
        "magic_school": "Abjuration",
        "materials": "A thin sheet of lead, a piece of opaque glass, a wad of cotton or cloth, and powdered chrysolite",
        "name": "Mordenkainens Private Sanctum",
        "ritual": false
    },
    "mordenkainens sword": {
        "casting_range": "60 feet",
        "casting_time": "1 action",
        "classes": [
            "Bard",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration. \n\nWhen the sword appears, you make a melee spell attack against a target of your choice within 5 feet of the sword. On a hit. the target takes 3d10 force damage. Until the spell ends, you can use a bonus action on each of your turns to move the sword up to 20 feet to a spot you can see and repeat this attack against the same target or a different one. \n",
        "duration": "Concentration, up to 1 minute",
        "level": 7,
        "magic_school": "Evocation",
        "materials": "A miniature platinum sword with a grip and pommel of copper and zinc, worth 250 gp",
        "name": "Mordenkainens Sword",
        "ritual": false
    },
    "move earth": {
        "casting_range": "120 feet",
        "casting_time": "1 action",
        "classes": [
            "Druid",
            "Sorcerer",
            "Wizard"
        ],
        "components": [
            "V",
            "S",
            "M"
        ],
        "desc": "Choose an area of terrain no larger than 40 feet on a side within range. You can reshape dirt, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area’s elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can’t exceed half the area’s largest dimension. So, if you affect a 40-foot square, you can create a pillar up to 20 feet high, raise or lower the square’s elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. \n It takes 10 minutes for these changes to complete. \n\nAt the end of every 10 minutes you spend concentrating on the spell, you can choose a new area of terrain to affect. \n\nBecause the terrain’s transformation occurs slowly, creatures in the area can’t usually be trapped or injured by the ground’s movement. \n\nThis spell can’t manipulate natural stone or stone construction. Rocks and structures shift to accommodate the new terrain. If the way you shape the terrain would make a structure unstable, it might collapse. \n\nSimilarly, this spell doesn’t directly affect plant growth. The moved earth carries any plants along with it. \n",
        "duration": "Concentration, up to 2 hours",
        "level": 6,
        "magic_school": "Transmutation",
        "materials": "An iron blade and a small bag containing a mixture of soils—clay, loam, and sand",
        "name": "Move Earth",
        "ritual": false
    }
}